StructEst_Presentation/slides.tex
% Created 2019-02-20 Wed 11:26
% Intended LaTeX compiler: pdflatex
\documentclass[bigger]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{Schwieg}
\usepackage{natbib}
\usepackage{tikz}
\usepackage{bm}
\usepackage{minted}
\usetheme{Montpellier}
\author{Timothy Schwieg}
\date{\today}
\title{The benefits of Randomization Mechanisms in Counter-Strike: Global Offensive}
\hypersetup{
 pdfauthor={Timothy Schwieg},
 pdftitle={The benefits of Randomization Mechanisms in Counter-Strike: Global Offensive},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle


\section{Topic}
\label{sec:org90275fc}
\begin{frame}[label={sec:org8c25e2e}]{Loot Boxes}
\begin{itemize}
\item Many video games have chosen to sell cosmetic alterations to their
games using randomization mechanisms called ``loot boxes''
\item Economic Literature tells us that there is no benefit to
randomization for risk-neutral consumers, so the benefit must come
from risk-loving consumers.
\item What aspect of these lotteries is generating the revenue for the
companies selling them?
\item How much more revenue-generating is this compared to traditional
selling mechanisms?
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgb71bc63}]{Why do we care?}
\begin{itemize}
\item We are interested in discovering what drives this market to feature
randomization mechanisms.
\item Are consumers inherently more risk-loving when they play video
games?
\item Is this driven by consumers over-weighting tiny probabilities as
cumulative prospect theory suggests?
\item Are consumers weighing benefits and losses differently?
\item What is the magnitude of these gains from randomization?
\end{itemize}
\end{frame}

\section{Data}
\label{sec:org96b39c8}
\begin{frame}[label={sec:orgf1c9886}]{The Data}
\begin{itemize}
\item Contains complete market history for all items sold in the Steam
Community Market for \emph{Counter-Strike: Global Offensive}
\item Market history is specific to the hour for the last 30 days,
specific to the day for the remaining time the item has existed.
\item Contains all active buy and sell orders for each of these items as
of March 31\(^{\text{st}}\) 2018.
\item Number of active players per day and unique twitch viewers per day
\end{itemize}
\end{frame}

\section{Model}
\label{sec:orgd0dc4ac}

\begin{frame}[label={sec:org51c43d8}]{Discrete Choice - Berry (1994)}
Utility for these lotteries is quasi-linear
\begin{equation*}
  u_{ijt} = V( x_{jt}, p_{jt}; \theta ) + \xi_{jt} + \epsilon_{ij} \quad \epsilon_{ij} \sim Gumbel
\end{equation*}

Consumers choose the lottery that has the highest utility for them: 

\begin{equation*}
  \Pr( i \rightarrow j ) = \frac{\exp( V(x_{jt},p_{jt} ; \theta) + \xi_{jt})}{ \sum_{k \in \mathcal{F}}
    \exp(V(x_{jt},p_{jt}; \theta) + \xi_{kt})}
\end{equation*}

Using an outside option that is normalized so that it has zero
utility:

\begin{equation*}
  \log s_{jt} - \log s_{0t} = V(x_{jt}, p_{jt}; \theta) + \xi_{jt}
\end{equation*}
\end{frame}



\begin{frame}[label={sec:org5aa67ff}]{Cumulative Prospect Theory}
\begin{itemize}
\item Four main components: Reference dependence, loss aversion,
diminishing sensitivity, and probability weighting
\end{itemize}
\begin{align*}
  \Pi_{s_i} &= \sum_{j=1}^{s_i} \pi_{s_j}\\
  v(x) &=
  \begin{cases}
    x^\alpha \quad &x \geq 0\\
    -\lambda(-x)^\alpha \quad &x < 0
  \end{cases}\\
  w(P) &= \frac{ P^\delta }{( P^\delta + (1-P)^\delta )^{\frac{1}{\delta}}}\\
  \\
  F(x_i) &= \brak{w( \Pi_{s_i}) - w(\Pi_{s_i - 1}) } v( x_i - p_j - 2.50)
\end{align*}
\end{frame}



\begin{frame}[label={sec:orgcfd5afa}]{Estimation}
\begin{itemize}
\item Price is determined by intersection of supply and demand and is
therefore endogenous
\item Instrument with the changes in daily player base from the average
number of players
\end{itemize}

\begin{align*}
  \xi_{jt} = \log s_{jt} - \log s_{0t} - V( x_{jt}, p_{jt}; \theta)
\end{align*}
Using the orthogonality of \(\xi_{jt}\) to the instruments and exogenous
parameters:
\begin{align*}
  &\min_{\bm{\xi}_{j,t}, \xi_{j,t}} \sum_{j,t}\bm{\xi}_{j,t}' \Omega \bm{\xi}_{j,t}\\
  \text{subject to: } &\xi_{j,t} = \log s_{jt} - \log s_{0t} - V( x_{jt}, p_{jt}; \theta)\\
  &\bm{\xi}_{j,t} = \xi_{j,t} \bm{Z}_{j,t}  
\end{align*}
\end{frame}
\end{document}